DataProcessors/ДМ_УправлениеОтправкойОбогащенныхEDIФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ДМ_УправлениеОтправкойОбогащенныхEDIФайлов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДокументыНаОтправку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортнаяОперация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлыОбменаDanoneКлиент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДМ_ФайлыОбменаDanoneКлиент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗарегистрироватьДляОтправки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зарегистрирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДМ_EDIКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДМ_EDIКлиенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FTPСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_ПараметрыПодключенияFTP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДМ_ГлобальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GUID_Меркурий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПолученияЗаявкиСервисом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяФормированияРезультата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПолученияРезультатаВыполненияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъединениеЗаписейСкладскогоЖурнала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеСведенийОЛабораторныхИсследованиях</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводственныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеНомеровТранспортныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризации</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеВСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДМ_ДокументыОбменаDanone_EDIКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДМ_ДокументыОбменаDanone_EDIКлиенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Передано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДМ_ДокументыОбменаDanone</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДМ_ФайлыОбменаDanoneКлиент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортнаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДМ_СтрокиЗаписейЖурналаРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДМ_СтрокиЗаписейЖурналаРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоединения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДанныеЗаписи</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеИмя</Name>
					<Comment>Представление события</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_СобытияЖурналаРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_ТипыПриложений1С</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДМ_УровниЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ДМ_ФайлыОбменаDanoneКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ДМ_ФайлыОбменаDanoneКлиент</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИсходный</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОбработанныйПоОбменуСМеркурием</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИсходногоФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиОбработанногоФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДокументаСФайламиSAP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_СвязанныйДокументУВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДМ_GLNСети</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДМ_СвязанныеДокументыУВС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДМ_СвязанныйДокументУВС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТранспортныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ДМ_УправлениеОтправкойОбогащенныхEDIФайлов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого лСтрока Из Объект.ДокументыНаОтправку Цикл
		лСтрока.ЗарегистрироватьДляОтправки = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого лСтрока Из Объект.ДокументыНаОтправку Цикл
		лСтрока.ЗарегистрироватьДляОтправки = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправленныеНаСервере()
	
	ЗаполнитьДокументыНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтправленные(Команда)
	ЗаполнитьОтправленныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНеОтправленные(Команда)
	ЗаполнитьНеОтправленныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаСервере(НеОтправленные = Истина)
	
	Объект.ДокументыНаОтправку.Очистить();
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТранспортныеОперации.Ссылка КАК ТранспОперация,
	             |	ЕСТЬNULL(ДМ_EDIКлиенты.ДМ_ГлобальныйНомер, """") КАК ДМ_ГлобальныйНомер,
	             |	ТранспортныеОперации.Дата КАК Дата,
	             |	ЕСТЬNULL(ДМ_ДокументыОбменаDanone_EDIКлиенты.Передано, ЛОЖЬ) КАК Передано,
	             |	ЕСТЬNULL(ДМ_ДокументыОбменаDanone_EDIКлиенты.ДатаПередачи, &ПустаяДата) КАК ДатаПередачи,
	             |	ЕСТЬNULL(ДМ_ДокументыОбменаDanone_EDIКлиенты.ДМ_ДокументыОбменаDanone, &ПустойДокОбмена) КАК ДокументыОбменаDanoneРегистрация,
	             |	ДМ_ФайлыОбменаDanoneКлиент.Ссылка КАК ДокОбмена,
	             |	ДМ_ФайлыОбменаDanoneКлиент.ДМ_GLNСети КАК ДМ_GLNСети,
	             |	ЕСТЬNULL(ЖурналРегистрацииСостоянийЗаявокНаОформлениеОперацийСрезПоследних.Статус,&ПустойСтатус) КАК СтатусДокТО
	             |ИЗ
	             |	Документ.ДМ_ФайлыОбменаDanoneКлиент КАК ДМ_ФайлыОбменаDanoneКлиент
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДМ_EDIКлиенты КАК ДМ_EDIКлиенты
	             |		ПО ДМ_ФайлыОбменаDanoneКлиент.ДМ_GLNСети = ДМ_EDIКлиенты.ДМ_ГлобальныйНомер
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДМ_ФайлыОбменаDanoneКлиент.ДМ_СвязанныеДокументыУВС КАК ДМ_ФайлыОбменаDanoneКлиентДМ_СвязанныеДокументыУВС
	             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныеОперации КАК ТранспортныеОперации
	             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.СрезПоследних КАК ЖурналРегистрацииСостоянийЗаявокНаОформлениеОперацийСрезПоследних
	             |				ПО ТранспортныеОперации.Ссылка = ЖурналРегистрацииСостоянийЗаявокНаОформлениеОперацийСрезПоследних.ДокументСсылка
	             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДМ_ДокументыОбменаDanone_EDIКлиенты КАК ДМ_ДокументыОбменаDanone_EDIКлиенты
	             |				ПО ТранспортныеОперации.Ссылка = ДМ_ДокументыОбменаDanone_EDIКлиенты.ТранспортнаяОперация
	             |			ПО ДМ_ФайлыОбменаDanoneКлиентДМ_СвязанныеДокументыУВС.ДМ_СвязанныйДокументУВС = ТранспортныеОперации.Ссылка
	             |		ПО ДМ_ФайлыОбменаDanoneКлиент.Ссылка = ДМ_ФайлыОбменаDanoneКлиентДМ_СвязанныеДокументыУВС.Ссылка
	             |ГДЕ
	             |	ЖурналРегистрацииСостоянийЗаявокНаОформлениеОперацийСрезПоследних.Статус = &УспешныйСтатус
	             |	И ДМ_ФайлыОбменаDanoneКлиент.ДМ_GLNСети <> &ПустаяСтрока
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата";
	
	Запр.Параметры.Вставить("ПустаяСтрока","");
	Запр.Параметры.Вставить("ПустаяДата",Дата(1,1,1));
	Запр.Параметры.Вставить("ПустойДокОбмена",Документы.ДМ_ФайлыОбменаDanoneКлиент.ПустаяСсылка());
	Запр.Параметры.Вставить("УспешныйСтатус",Справочники.СтатусыЗаявок.УспешноОбработана);
	Запр.Параметры.Вставить("ПустойСтатус",Справочники.СтатусыЗаявок.ПустаяСсылка());
	
	ВыбЗапр = Запр.Выполнить().Выбрать();
	Пока ВыбЗапр.Следующий() Цикл
		Если НеОтправленные И ВыбЗапр.ДатаПередачи <> Дата(1,1,1) Тогда
			Продолжить;
		ИначеЕсли Не НеОтправленные И ВыбЗапр.ДатаПередачи = Дата(1,1,1) Тогда
			Продолжить;
		КонецЕсли;	
		НовСтр = Объект.ДокументыНаОтправку.Добавить();
		НовСтр.ТранспортнаяОперация = ВыбЗапр.ТранспОперация;
		НовСтр.ФайлыОбменаDanoneКлиент = ВыбЗапр.ДокОбмена;
		НовСтр.ДатаОтправки = ВыбЗапр.ДатаПередачи;
		НовСтр.Зарегистрирован = ?(ЗначениеЗаполнено(ВыбЗапр.ДокументыОбменаDanoneРегистрация),Истина,Ложь);
	КонецЦикла;	
	
КонецПроцедуры	
	


&НаСервере
Процедура ЗаполнитьНеОтправленныеНаСервере()
	
	ЗаполнитьДокументыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура("ДанныеЗаписи", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ДМ_СтрокиЗаписейЖурналаРегистрации.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрКоманды.УникальныйИдентификатор(), ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегистрациюНаСервере(мДок)
	
	КвоОтпр = 0;
	Для мм=0 по мДок.Количество()-1 Цикл
		Результат = ДМ_ИнтеграцияУВСSAP.СозданиеОбогащенногоEDIФайл_РегистрацияНаОтправку(мДок.Получить(мм).ПолучитьОбъект(),Истина);
		Если Результат = Истина Тогда	
			КвоОтпр = КвоОтпр + 1;
		КонецЕсли;	
	КонецЦикла;			
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зарегистрированы к отправке " + КвоОтпр + " документов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтрокиЗаписейЖурналаРегистрации()
	
	Если Элементы.ДокументыНаОтправку.ТекущиеДанные <> Неопределено Тогда
		ТекДок = Элементы.ДокументыНаОтправку.ТекущиеДанные.ТранспортнаяОперация;
		Если ЗначениеЗаполнено(ТекДок) Тогда
			Отбор = Новый Структура("ДанныеЗаписи", ТекДок);
			ПараметрыФормы = Новый Структура("Отбор", Отбор);
			ОткрытьФорму("РегистрСведений.ДМ_СтрокиЗаписейЖурналаРегистрации.ФормаСписка", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКОтправке(Команда)
	
	СтрОтб = Новый Структура;
	СтрОтб.Вставить("ЗарегистрироватьДляОтправки",Истина);
	мСтр = Объект.ДокументыНаОтправку.НайтиСтроки(СтрОтб);
	Если мСтр.Количество() = 0  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет указанных к регистрации документов");
		Возврат;
	КонецЕсли;	
	
	мДок = Новый Массив;
	Для мм=0 по мСтр.Количество()-1 Цикл
		мДок.Добавить(мСтр.Получить(мм).ТранспортнаяОперация);
	КонецЦикла;	
	
	ВыполнитьРегистрациюНаСервере(мДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаОтправкуПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыНаОтправкуПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры
